Switch workflow sequence to PlantUML
